#!/bin/bash
################################################################################
##
##	ファイル名	:	addusers_txt_maker.sh
##
##	機能概要	:	addusers.txt作成用シェル
##					(既存sambaユーザーの抜き出し)
##	入出力 I/F
##		INPUT	:	
##		OUTPUT	:	
##
##	作成者		:	J.Itou
##
##	作成日付	:	2016/02/11
##
##	改訂履歴	:	
##	   日付       版         名前      改訂内容
##	---------- -------- -------------- -----------------------------------------
##	2016/02/11 000.0000 J.Itou         新規作成
##	YYYY/MM/DD 000.0000 xxxxxxxxxxxxxx 
##	---------- -------- -------------- -----------------------------------------
################################################################################
#set -nvx

# Pause処理 --------------------------------------------------------------------
funcPause() {
	RET_STS=$1

	if [ ${RET_STS} -ne 0 ]; then
		echo "Enterキーを押して下さい。"
		read DUMMY
	fi
}

#-------------------------------------------------------------------------------
# Initialize
#-------------------------------------------------------------------------------
	DBG_FLAG=${DBG_FLAG:-0}
	if [ ${DBG_FLAG} -ne 0 ]; then
		set -vx
	fi

	# ワーク変数設定 -----------------------------------------------------------
	NOW_TIME=`date +"%Y%m%d%H%M%S"`
	PGM_NAME=`basename $0 | sed -e 's/\..*$//'`

	DST_NAME=`awk '/[A-Za-z]./ {print $1;}' /etc/issue | head -n 1 | tr '[A-Z]' '[a-z]'`

	DIR_WK=/work

	LST_USER=${DIR_WK}/addusers.txt

	# ワーク・ディレクトリーの変更 --------------------------------------------
	pushd ${DIR_WK}

#------------------------------------------------------------------------------
# Make User file
#------------------------------------------------------------------------------
	rm -f ${LST_USER}
	touch ${LST_USER}

	USR_LIST=`pdbedit -L | awk -F : '{print $1;}'`
	for USR_NAME in ${USR_LIST}
	do
		LINE=`pdbedit -w -u ${USR_NAME}`

		USERNAME=`echo ${LINE} | awk -F : '{print $1;}' | tr '[A-Z]' '[a-z]'`
		USERIDNO=`echo ${LINE} | awk -F : '{print $2;}'`
		LMPASSWD=`echo ${LINE} | awk -F : '{print $3;}'`
		NTPASSWD=`echo ${LINE} | awk -F : '{print $4;}'`
		ACNTFLAG=`echo ${LINE} | awk -F : '{print $5;}'`
		CHNGTIME=`echo ${LINE} | awk -F : '{print $6;}'`
		FULLNAME=`pdbedit -u ${USERNAME} | awk -F : '{print $3;}'`
		echo "${USERNAME}:${FULLNAME}:${USERIDNO}::${LMPASSWD}:${NTPASSWD}:${ACNTFLAG}:${CHNGTIME}:" >> ${LST_USER}
	done

#------------------------------------------------------------------------------
# Termination
#------------------------------------------------------------------------------
	popd

#------------------------------------------------------------------------------
# Exit
#------------------------------------------------------------------------------
	exit 0

#------------------------------------------------------------------------------
# End of file
#------------------------------------------------------------------------------
